const str = [{"'1#骨料'":10019764,"'2#骨料'":3446138,"'3#骨料'":3604176,"'4#骨料'":3660214,"'5#骨料'":0,"'6#骨料'":657490,"'7#骨料'":1224904,"'8#骨料 '":525191,"'水泥1#'":628801,"'水泥2#'":752452,"'水泥3#'":0,"'水泥4#'":0,"'水泥5#'":0,"'水泥6#'":0,"'粉灰1#'":327546.99974823,"'粉灰2#'":383563.80041503906,"'粉灰3#'":0,"'矿粉1#'":0,"'矿粉2#'":0,"'矿粉3#'":0,"'水'":0,"'水1'":1083102.1999816895,"'附加剂一1#'":17156.07999420166,"'附加剂一2#'":0,"'附加剂一3#'":28662.59999680519,"'附加剂二1#'":0,"'附加剂二2#'":0,"'附加剂二3#'":0}]
const obj = {}
const newArrStr = str[0]
for (const key in newArrStr) {
  if (key){
    const keys = key.substr(1,key.length-2)
    console.log(keys)
    obj[keys] = newArrStr[key]
  }
}
console.log("'abcdef'".substr(1,5))
console.log(obj)

//