/*
// -- 字典初始数据脚本（产品字典）
UPSERT INTO g_data_dictionary(id, parent_id, full_id, name, full_name, level, is_leaf, is_tree, is_static, code, sort_code, created_at, version) VALUES
(776034788840448, -1, '776034788840448', '产品字典', '产品字典', 1, true, false, true, 'productType', 1, now(), 0),

(777971828954112, 776034788840448, '776034788840448|777971828954112', '全局设置', '产品字典|全局设置', 2, true, false, true, 'mreport', 1, now(), 0),
(776036519810048, 776034788840448, '776034788840448|776036519810048', '物资报表中心', '产品字典|物资报表中心', 2, true, false, true, 'mreport', 2, now(), 0),
(776036710814720, 776034788840448, '776034788840448|776036710814720', '物资基础数据', '产品字典|物资基础数据', 2, true, false, true, 'cbaseinfo', 3, now(), 0),
(776036863235072, 776034788840448, '776034788840448|776036863235072', '物资账务管理系统', '产品字典|物资账务管理系统', 2, true, false, true, 'maccount', 4, now(), 0),
(776037051716608, 776034788840448, '776034788840448|776037051716608', '周转材料管理系统', '产品字典|周转材料管理系统', 2, true, false, true, 'mturnover', 5, now(), 0),
(776037221192704, 776034788840448, '776034788840448|776037221192704', '物资实物管控系统', '产品字典|物资实物管控系统', 2, true, false, true, 'mquantity', 6, now(), 0),
(776037648774144, 776034788840448, '776034788840448|776037648774144', '物资产品配置', '产品字典|物资产品配置', 2, true, false, true, 'smconfig', 7, now(), 0),
(783921126994944, 776034788840448, '776034788840448|783921126994944', '混凝土核算系统', '产品字典|混凝土核算系统', 2, true, false, true, 'concrete', 8, now(), 0),
(783921879643136, 776034788840448, '776034788840448|783921879643136', '物资移动收发应用', '产品字典|物资移动收发应用', 2, true, false, true, 'mquantity-rds-app-pack', 9, now(), 0)*/
